# Arbitrary value imputation

## Replacing NAN with arbitrary value

In [1]:
import pandas as pd
df=pd.read_csv('titanic.csv',usecols=['Age','Fare','Survived'])
df.head()

   Survived   Age     Fare
0         0  22.0   7.2500
1         1  38.0  71.2833
2         1  26.0   7.9250
3         1  35.0  53.1000
4         0  35.0   8.0500

In [3]:
df.Age.value_counts()

24.00    30
22.00    27
18.00    26
19.00    25
28.00    25
         ..
36.50     1
55.50     1
0.92      1
23.50     1
74.00     1
Name: Age, Length: 88, dtype: int64

In [2]:
def replace_nan(df,variable):
    df[variable+'_zero']=df[variable].fillna(0)
    df[variable+'_hunderd']=df[variable].fillna(100)
    
    # replaced with least and last value of the distribution

In [3]:
replace_nan(df,'Age')

In [4]:
df.head()

   Survived   Age     Fare  Age_zero  Age_hunderd
0         0  22.0   7.2500      22.0         22.0
1         1  38.0  71.2833      38.0         38.0
2         1  26.0   7.9250      26.0         26.0
3         1  35.0  53.1000      35.0         35.0
4         0  35.0   8.0500      35.0         35.0